
app.controller('doctorCtl', function($scope,$rootScope,appTool){
    appTool.toTop();
    let docHeight = screen.availHeight;
	let hei = $('#workbench_header').height();
	
	$scope.headerBackground = {
		url:'/images/doctor/back.jpg',
		height:docHeight - hei - 60
	}

	$scope.doctor = {
		title:'乡村医疗',
		desc:'当我坐在川北医学院的医学实验室的时候，我总会想起刚刚过去的半年多里，我感到充实、奔波、忙碌、紧张、感动、有意义，虽有争吵、误解、失望、挑战，却让我此生无悔入织心。这已经是我第三年参加“织心志愿者”的乡村服务项目了，不同于往年，我今年是医疗服务项目的三个总负责人之一。我从一个参与者，变成了医疗项目的设计者、团队管理者，第一次站在一个组织者的角度去思考和运营一个公益项目。现在我就来分享一下我们的运营经验，为其他团队提供参考。'
	}
	
	$scope.design = {
		title:'项目设计',
		imgUrl:'/images/doctor/1.jpg',
		descs:[
			'我记得老耿给我们做培训的时候说：“我们要做某个公益项目，就必须看别人是否对我们的服务有需求，再根据需求去做方案。”因此在活动开始规划前，我开始对项目地进行调研。我们的项目地落户在四川多个地方，因此每个地方的情况也不同，我就以泸州项目点为案例。在我们调研的过程中，我们发现我们项目地居民卫生意识较差、儿童卫生习惯较差、基础医疗设施少、项目地甲肝多发和寄生虫病多发区域，另外儿童的身体发育状况也有营养偏低与不均衡特点，但当地的资源无法为其提供长期且频繁的卫生宣传，使上述问题成为固定性社会难题。',
			'于是我们针对我们发现的问题，设计解决方案：以儿童、老人和妇女为重点服务对象，针对儿童与成年居民开展高特色、多板块高质量义诊，从基础义诊和特色板块两方面覆盖血压、血糖、口腔、眼视光等众多项目；成年人群开展急救CPR步骤、包扎知识、夏季传染病知识宣传；儿童高危意外伤害事故防护知识教育、寄生虫传染知识宣传、包扎知识宣传、夏季溺水级其他意外伤害急救知识宣传、CPR急救步骤宣讲；卫生视频公映宣讲。',
			'于是我们针对我们发现的问题，设计解决方案：',
			'以儿童、老人和妇女为重点服务对象，针对儿童与成年居民开展高特色、多板块高质量义诊，从基础义诊和特色板块两方面覆盖血压、血糖、口腔、眼视光等众多项目；成年人群开展急救CPR步骤、包扎知识、夏季传染病知识宣传；儿童高危意外伤害事故防护知识教育、寄生虫传染知识宣传、包扎知识宣传、夏季溺水级其他意外伤害急救知识宣传、CPR急救步骤宣讲；卫生视频公映宣讲。',
		]
	}

	$scope.train = {
		title:'人员培训',
		descs:[
			'我知道，工欲善其事，必先利其器，必先培养人。在活动开始前，我们进行了一系列物资采购和专业规范的志愿者培训。我们制定了一个详细的规范培养计划并做了详细的培训，力求全面、有效。',
		],
		plains:[
			{time:'5月5日',add:'川北医学院图书信息大楼406',content:'医学人文素质培训',desc:'义诊操守；禁忌和要求'},
			{time:'5月5日',add:'川北医学院图书信息大楼406',content:'医学人文素质培训',desc:'义诊操守；禁忌和要求'},
			{time:'5月5日',add:'川北医学院图书信息大楼406',content:'医学人文素质培训',desc:'义诊操守；禁忌和要求'},
			{time:'5月5日',add:'川北医学院图书信息大楼406',content:'医学人文素质培训',desc:'义诊操守；禁忌和要求'},
			{time:'5月5日',add:'川北医学院图书信息大楼406',content:'医学人文素质培训',desc:'义诊操守；禁忌和要求'},
			{time:'5月5日',add:'川北医学院图书信息大楼406',content:'医学人文素质培训',desc:'义诊操守；禁忌和要求'},
		]
	}

	$scope.raise = {
		title:'资金筹集和物资采购',
		descs:[
			'作为“织心志愿者”所有项目中最花钱的医疗板块项目，我们尽可能节省开支，根据项目实际需求进行资金精确预算，采用“能租借就租借、能不买就不买”的原则进行物资采购。',
			'很幸运，我们获得了“走向西部”的支持，总共为我们“织心志愿者”医疗服务专项资助了资金7000元。',
		],
		plains:[
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
			{thing:'医用口罩',unit:'袋（100）',count:20,price:10,money:200},
		]
	}

	$scope.action = {
		title:'服务项目',
		acts:['基础板块义诊','特色义诊','卫生理论'],
		doPage:function(that){
			let eleFlag = '[data-act="'+that+'"]';		
			$(eleFlag).css('transform','rotateX(40deg) rotateY(180deg)');		
		}
	}

	$scope.doS = that => {
		alert(that)
	}
})